import replaceFromMap from './replaceFromMap';

/**
 * 濁点・半濁点とひらがな・かたかなを結合させる
 *
 * @version 2.0.0
 * @since 1.2.0
 * @param str 対象の文字列
 * @param convertOnly ひらがな・かたかなと結合させずに、文字だけ結合文字に変換
 */
export default function combinateSoundMarks (str: string, convertOnly: boolean = false): string {
	if (!convertOnly) {
		// 結合文字に変換
		str = combinateSoundMarks(str, true);
		// 濁点・半濁点を結合する
		str = replaceFromMap(str, {
			// 濁点
			'か\u3099': 'が', 'き\u3099': 'ぎ', 'く\u3099': 'ぐ', 'け\u3099': 'げ', 'こ\u3099': 'ご',
			'さ\u3099': 'ざ', 'し\u3099': 'じ', 'す\u3099': 'ず', 'せ\u3099': 'ぜ', 'そ\u3099': 'ぞ',
			'た\u3099': 'だ', 'ち\u3099': 'ぢ', 'つ\u3099': 'づ', 'て\u3099': 'で', 'と\u3099': 'ど',
			'は\u3099': 'ば', 'ひ\u3099': 'び', 'ふ\u3099': 'ぶ', 'へ\u3099': 'べ', 'ほ\u3099': 'ぼ',
			'カ\u3099': 'ガ', 'キ\u3099': 'ギ', 'ク\u3099': 'グ', 'ケ\u3099': 'ゲ', 'コ\u3099': 'ゴ',
			'サ\u3099': 'ザ', 'シ\u3099': 'ジ', 'ス\u3099': 'ズ', 'セ\u3099': 'ゼ', 'ソ\u3099': 'ゾ',
			'タ\u3099': 'ダ', 'チ\u3099': 'ヂ', 'ツ\u3099': 'ヅ', 'テ\u3099': 'デ', 'ト\u3099': 'ド',
			'ハ\u3099': 'バ', 'ヒ\u3099': 'ビ', 'フ\u3099': 'ブ', 'ヘ\u3099': 'ベ', 'ホ\u3099': 'ボ',
			'ワ\u3099': 'ヷ', 'イ\u3099': 'ヸ', 'ウ\u3099': 'ヴ', 'エ\u3099': 'ヹ', 'ヺ\u3099': 'ヲ',
			'ゝ\u3099': 'ゞ', 'ヽ\u3099': 'ヾ',
			// 半濁点
			'は\u309A': 'ぱ', 'ひ\u309A': 'ぴ', 'ふ\u309A': 'ぷ', 'へ\u309A': 'ぺ', 'ほ\u309A': 'ぽ',
			'ハ\u309A': 'パ', 'ヒ\u309A': 'ピ', 'フ\u309A': 'プ', 'ヘ\u309A': 'ペ', 'ホ\u309A': 'ポ',
		});
	} else {
		// ひらがな・かたかなと結合させずに、文字だけ結合文字に変換
		str = replaceFromMap(str, {
			// 濁点
			'\u309B': '\u3099', // 全角濁点 → 全角結合文字濁点
			'\uFF9E': '\u3099', // 半角濁点 → 全角結合文字濁点
			// 半濁点
			'\u309C': '\u309A', // 全角半濁点 → 全角結合文字半濁点
			'\uFF9F': '\u309A', // 半角半濁点 → 全角結合文字半濁点
		});
	}
	return str;
}
