import convertProlongedSoundMarks from '../../fn/convertProlongedSoundMarks.js';
import { test, expect } from 'vitest';

test('長音符変換', () => {
  const a = [
    'あーぁーかーゕーがーさーざーたーだーなーはーばーぱーまーやーゃーらー',
    'わーゎーいーぃーきーぎーしーじーちーぢーにーひーびーぴーみーりーゐー',
    'うーぅーゔーくーぐーすーずーつーづーぬーふーぶーぷーむーゆーゅーるー',
    'えーぇーけーゖーげーせーぜーてーでーねーへーべーぺーめーれーゑーおー',
    'ぉーこーごーそーぞーとーどーのーほーぼーぽーもーよーょーろーをー',
    'アーァーカーヵーガーサーザーターダーナーハーバーパーマーヤーャーラー',
    'ワーヮーイーィーキーギーシージーチーヂーニーヒービーピーミーリーヰー',
    'ウーゥーヴークーグースーズーツーヅーヌーフーブープームーユーュールー',
    'エーェーケーヶーゲーセーゼーテーデーネーヘーベーペーメーレーヱーオー',
    'ォーコーゴーソーゾートードーノーホーボーポーモーヨーョーローヲー',
    'ヷーヸーヹーヺー',
    'んーっーンーッー',
  ].join('');
  const b = [
    'ああぁあかあゕあがあさあざあたあだあなあはあばあぱあまあやあゃあらあ',
    'わあゎあいいぃいきいぎいしいじいちいぢいにいひいびいぴいみいりいゐい',
    'ううぅうゔうくうぐうすうずうつうづうぬうふうぶうぷうむうゆうゅうるう',
    'ええぇえけえゖえげえせえぜえてえでえねえへえべえぺえめえれえゑえおお',
    'ぉおこおごおそおぞおとおどおのおほおぼおぽおもおよおょおろおをお',
    'アアァアカアヵアガアサアザアタアダアナアハアバアパアマアヤアャアラア',
    'ワアヮアイイィイキイギイシイジイチイヂイニイヒイビイピイミイリイヰイ',
    'ウウゥウヴウクウグウスウズウツウヅウヌウフウブウプウムウユウュウルウ',
    'エエェエケエヶエゲエセエゼエテエデエネエヘエベエペエメエレエヱエオオ',
    'ォオコオゴオソオゾオトオドオノオホオボオポオモオヨオョオロオヲオ',
    'ヷアヸイヹエヺオ',
    'んんっっンンッッ',
  ].join('');
  expect(convertProlongedSoundMarks(a)).toBe(b);
});

test('長音符変換2', () => {
  expect(convertProlongedSoundMarks('ウバッシャアーーーーーーーーー')).toBe(
    'ウバッシャアアアアアアアアアア',
  );
});
