import { describe, expect, test } from 'vitest';
import toNarrow from '../../fn/toNarrow.js';

describe('toNarrow', () => {
  test('半角化', () => {
    const a = [
      '　！＂＃＄％＆＇（）＊＋，－．／０１２３４５６７８９：；＜＝＞？＠Ａ',
      'ＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺ［］＾＿｀ａｂｃｄ',
      'ｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ｛｜｝～',
      'ヲァィゥェォャュョッーアイウエオカキクケコサシスセソタチツテトナニヌ',
      'ネノハヒフヘホマミムメモヤユヨラリルレロワン゛゜ガギグゲゴザジズゼゾ',
      'ダヂヅデドバビブベボパピプペポヷヸヴヹヺ',
      'をぁぃぅぇぉゃゅょっーあいうえおかきくけこさしすせそたちつてとなにぬ',
      'ねのはひふへほまみむめもやゆよらりるれろわんがぎぐげござじずぜぞだぢ',
      'づでどばびぶべぼぱぴぷぺぽわ゛ゐ゛ゔゑ゛を゛わ゙ゐ゙ゔゑ゙を゙',
      '。「」、・',
    ].join('');
    const b = [
      ' !"#$%&\'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[]^_`',
      'abcdefghijklmnopqrstuvwxyz{|}~',
      'ヲァィゥェォャュョッーアイウエオカキクケコサシスセソタチツテトナニヌ',
      'ネノハヒフヘホマミムメモヤユヨラリルレロワン゛゜ガギグゲゴザジズゼゾ',
      'ダヂヅデドバビブベボパピプペポヷヸヴヹヺ',
      'をぁぃぅぇぉゃゅょっーあいうえおかきくけこさしすせそたちつてとなにぬ',
      'ねのはひふへほまみむめもやゆよらりるれろわんがぎぐげござじずぜぞだぢ',
      'づでどばびぶべぼぱぴぷぺぽわ゛ゐ゛ゔゑ゛を゛わ゙ゐ゙ゔゑ゙を゙',
      '。「」、・',
    ].join('');
    expect(toNarrow(a)).toBe(b);
  });

  test('半角化2', () => {
    const a = [
      '　！＂＃＄％＆＇（）＊＋，－．／０１２３４５６７８９：；＜＝＞？＠Ａ',
      'ＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺ［］＾＿｀ａｂｃｄ',
      'ｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ｛｜｝～',
      'ヲァィゥェォャュョッーアイウエオカキクケコサシスセソタチツテトナニヌ',
      'ネノハヒフヘホマミムメモヤユヨラリルレロワン゛゜ガギグゲゴザジズゼゾ',
      'ダヂヅデドバビブベボパピプペポヷヸヴヹヺ',
      'をぁぃぅぇぉゃゅょっーあいうえおかきくけこさしすせそたちつてとなにぬ',
      'ねのはひふへほまみむめもやゆよらりるれろわんがぎぐげござじずぜぞだぢ',
      'づでどばびぶべぼぱぴぷぺぽわ゛ゐ゛ゔゑ゛を゛わ゙ゐ゙ゔゑ゙を゙',
      '。「」、・',
    ].join('');
    const b = [
      ' !"#$%&\'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[]^_`',
      'abcdefghijklmnopqrstuvwxyz{|}~',
      'ｦｧｨｩｪｫｬｭｮｯｰｱｲｳｴｵｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾅﾆﾇﾈﾉﾊﾋﾌﾍﾎﾏﾐﾑﾒﾓﾔﾕﾖﾗﾘﾙﾚﾛﾜﾝﾞﾟｶﾞｷﾞｸﾞｹﾞ',
      'ｺﾞｻﾞｼﾞｽﾞｾﾞｿﾞﾀﾞﾁﾞﾂﾞﾃﾞﾄﾞﾊﾞﾋﾞﾌﾞﾍﾞﾎﾞﾊﾟﾋﾟﾌﾟﾍﾟﾎﾟﾜﾞｲﾞｳﾞｴﾞｦﾞ',
      'をぁぃぅぇぉゃゅょっｰあいうえおかきくけこさしすせそたちつてとなにぬ',
      'ねのはひふへほまみむめもやゆよらりるれろわんがぎぐげござじずぜぞだぢ',
      'づでどばびぶべぼぱぴぷぺぽわﾞゐﾞゔゑﾞをﾞわﾞゐﾞゔゑﾞをﾞ',
      '｡｢｣､･',
    ].join('');
    expect(toNarrow(a, true)).toBe(b);
  });

  test('半角化3', () => {
    const a = ['Ａ', '\n', 'Ｂ'].join('');
    const b = ['A', '\n', 'B'].join('');
    expect(toNarrow(a, true)).toBe(b);
  });

  test('半角化4', () => {
    const a = ['Ａ', '\r', 'Ｂ'].join('');
    const b = ['A', '\r', 'B'].join('');
    expect(toNarrow(a, true)).toBe(b);
  });

  test('半角化5', () => {
    const a = ['Ａ', '\r\n', 'Ｂ'].join('');
    const b = ['A', '\r\n', 'B'].join('');
    expect(toNarrow(a, true)).toBe(b);
  });

  test('半角化6', () => {
    const a = ['Ａ', '\r\n', 'Ｂ'].join('');
    const b = ['A', ' ', 'B'].join('');
    expect(toNarrow(a, true)).not.toBe(b);
  });

  test('半角化7', () => {
    const a = ['Ａ', '\r\n', 'Ｂ'].join('');
    const b = ['A', '\r', 'B'].join('');
    expect(toNarrow(a, true)).not.toBe(b);
  });

  test('半角化8', () => {
    const a = ['Ａ', '\r', 'Ｂ'].join('');
    const b = ['A', '\r\n', 'B'].join('');
    expect(toNarrow(a, true)).not.toBe(b);
  });
});
