import { describe, expect, test } from 'vitest';
import toNarrowKatakana from '../../fn/toNarrowKatakana.js';

describe('toNarrowKatakana', () => {
  test('半角カタカナに変換', () => {
    const a = [
      '。「」、・',
      'ヲァィゥェォャュョッーアイウエオカキクケコサシスセソタチツテトナニヌ',
      'ネノハヒフヘホマミムメモヤユヨラリルレロワンガギグゲゴザジズゼゾダヂ',
      'ヅデドバビブベボパピプペポヷヸヴヹヺ゛゛',
      'をぁぃぅぇぉゃゅょっーあいうえおかきくけこさしすせそたちつてとなにぬ',
      'ねのはひふへほまみむめもやゆよらりるれろわんがぎぐげござじずぜぞだぢ',
      'づでどばびぶべぼぱぴぷぺぽわ゛ゐ゛ゔゑ゛を゛',
    ].join('');
    const b = [
      '。「」、・',
      'ｦｧｨｩｪｫｬｭｮｯｰｱｲｳｴｵｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾅﾆﾇﾈﾉﾊﾋﾌﾍﾎﾏﾐﾑﾒﾓﾔﾕﾖﾗﾘﾙﾚﾛﾜﾝｶﾞｷﾞｸﾞｹﾞ',
      'ｺﾞｻﾞｼﾞｽﾞｾﾞｿﾞﾀﾞﾁﾞﾂﾞﾃﾞﾄﾞﾊﾞﾋﾞﾌﾞﾍﾞﾎﾞﾊﾟﾋﾟﾌﾟﾍﾟﾎﾟﾜﾞｲﾞｳﾞｴﾞｦﾞﾞﾞ',
      'をぁぃぅぇぉゃゅょっｰあいうえおかきくけこさしすせそたちつてとなにぬ',
      'ねのはひふへほまみむめもやゆよらりるれろわんがぎぐげござじずぜぞだぢ',
      'づでどばびぶべぼぱぴぷぺぽわﾞゐﾞゔゑﾞをﾞ',
    ].join('');
    expect(toNarrowKatakana(a)).toBe(b);
  });

  test('半角カタカナに変換2', () => {
    const a = [
      '。「」、・',
      'ヲァィゥェォャュョッーアイウエオカキクケコサシスセソタチツテトナニヌ',
      'ネノハヒフヘホマミムメモヤユヨラリルレロワンガギグゲゴザジズゼゾダヂ',
      'ヅデドバビブベボパピプペポヷヸヴヹヺ゛゛',
      'をぁぃぅぇぉゃゅょっーあいうえおかきくけこさしすせそたちつてとなにぬ',
      'ねのはひふへほまみむめもやゆよらりるれろわんがぎぐげござじずぜぞだぢ',
      'づでどばびぶべぼぱぴぷぺぽわ゛ゐ゛ゔゑ゛を゛',
    ].join('');
    const b = [
      '。「」、・',
      'ｦｧｨｩｪｫｬｭｮｯｰｱｲｳｴｵｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾅﾆﾇﾈﾉﾊﾋﾌﾍﾎﾏﾐﾑﾒﾓﾔﾕﾖﾗﾘﾙﾚﾛﾜﾝｶﾞｷﾞｸﾞｹﾞ',
      'ｺﾞｻﾞｼﾞｽﾞｾﾞｿﾞﾀﾞﾁﾞﾂﾞﾃﾞﾄﾞﾊﾞﾋﾞﾌﾞﾍﾞﾎﾞﾊﾟﾋﾟﾌﾟﾍﾟﾎﾟﾜﾞｲﾞｳﾞｴﾞｦﾞﾞﾞ',
      'ｦｧｨｩｪｫｬｭｮｯｰｱｲｳｴｵｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾅﾆﾇﾈﾉﾊﾋﾌﾍﾎﾏﾐﾑﾒﾓﾔﾕﾖﾗﾘﾙﾚﾛﾜﾝｶﾞｷﾞｸﾞｹﾞ',
      'ｺﾞｻﾞｼﾞｽﾞｾﾞｿﾞﾀﾞﾁﾞﾂﾞﾃﾞﾄﾞﾊﾞﾋﾞﾌﾞﾍﾞﾎﾞﾊﾟﾋﾟﾌﾟﾍﾟﾎﾟﾜﾞｲﾞｳﾞｴﾞｦﾞ',
    ].join('');
    expect(toNarrowKatakana(a, true)).toBe(b);
  });

  test('カタカナとひらがな以外は変換しない', () => {
    const a = [
      '012０１２abcａｂｃABCＡＢＣ!"#$%&\'()！＂＃＄％＆＇（）。「」、・',
    ].join('');
    const b =
      '012０１２abcａｂｃABCＡＢＣ!"#$%&\'()！＂＃＄％＆＇（）。「」、・';
    expect(toNarrowKatakana(a)).toBe(b);
  });

  test('カタカナとひらがな以外は変換しない2', () => {
    const a = [
      '012０１２abcａｂｃABCＡＢＣ!"#$%&\'()！＂＃＄％＆＇（）。「」、・',
    ].join('');
    const b =
      '012０１２abcａｂｃABCＡＢＣ!"#$%&\'()！＂＃＄％＆＇（）。「」、・';
    expect(toNarrowKatakana(a)).toBe(b);
  });
});
